oc_parallel_contrast/src/main/resources/in/oldXml.xml

<soapenv:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:com="http://common.ws.yn.oss.ztesoft.com">
    <soapenv:Header/>
    <soapenv:Body>
        <com:rscService soapenv:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/">
            <infType xsi:type="soapenc:string" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/">IOMFORWFM</infType>
            <head xsi:type="soapenc:string" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/"></head>
            <body xsi:type="soapenc:string" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/">
                <![CDATA[
            <?xml version="1.0" encoding="UTF-8"?>
<root>
    <expInfo>
        <orderItem>
            <itemSpecId>3000</itemSpecId>
            <desc>局向ID</desc>
            <seq>1</seq>
            <newItemVal>000101125282</newItemVal>
            <oldItemVal/>
        </orderItem>
        <orderItem>
            <itemSpecId>10042</itemSpecId>
            <desc>标准地址ID</desc>
            <seq>1xx</seq>
            <newItemVal>28244148</newItemVal>
            <oldItemVal/>
        </orderItem>
        <orderItem>
            <itemSpecId>300084</itemSpecId>
            <desc>同址电话标识</desc>
            <seq>1</seq>
            <newItemVal>999</newItemVal>
            <oldItemVal/>
        </orderItem>
    </expInfo>
    <baseInfo>
        <orderId>8712109271535023734</orderId>
        <workOrderId>5786735</workOrderId>
        <productId>6600117000</productId>
    </baseInfo>
</root>
          ]]>
            </body>
        </com:rscService>
    </soapenv:Body>
</soapenv:Envelope>